app/controllers/users_controller.rb

	def create
		#la variable que se define llama a un modelo
		@user = User.new
		@user.name = params[:name]
		@user.email = params[:email]
		@user.city = params[:city]
		@user.password = params[:password]
		@user.skill = params[:skill]
		@user.skills = params[:skills]
		@user.expectation = params[:expectation]
		@user.expectation_reason = params[:expectation_reason]
		@user.ocupation = params[:ocupation]
		@user.observations = params[:observations]
		if @user.save
---
INSERT INTO "users" ("name", "email", "city", "password", "skill", "skills", "expectation", "expectation_reason", "ocupation", "observations", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"