app/controllers/welcome_controller.rb

INSERT INTO "welcomes" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Diego Zuluaga "], ["email", "diegozuluaga88@gmail.com"], ["created_at", "2015-10-28 23:53:50.973914"], ["updated_at", "2015-10-28 23:53:50.973914"]]
---
	def create
        @welcome = Welcome.new
        @welcome.name = params[:name]
        @welcome.email = params[:email]
        if @welcome.save

SELECT  "welcomes".* FROM "welcomes" WHERE "welcomes"."email" = $1  ORDER BY "welcomes"."id" ASC LIMIT 1  [["email", "diegozuluaga88@gmail.com"]]
---
    def connect
        @welcome = Welcome.where(email: request.env['omniauth.auth']["info"]["email"]).first